import 'package:flutter/material.dart';

class DetailSection extends StatelessWidget {
const DetailSection({Key? key}) : super(key: key);

@override
Widget build(BuildContext context) {
return Expanded(
child: Container(
padding: EdgeInsets.all(32),
child: Text(
'โรงภาพยนตร์ในรูปแบบซีนีเพล็กซ์ (Cineplex) สร้างขึ้นเป็นครั้งแรกในประเทศไทยเมื่อปี 2538 โดยคุณวิชา พูลวรลักษณ์ ในรูปแบบของ'
'Standalone โดยเป็นอาคาร 7-10 ชั้น ซึ่งรวมโรงภาพยนตร์และศูนย์รวมความบันเทิงไว้ด้วยกัน และมีพื้นที่ให้เช่าสำหรับร้านค้า ทำให้ผู้ชมได้รับ'
'อรรถรสทั้งจากจำนวนภาพยนตร์ที่หลากหลายและร้านค้าร้านอาหารที่มีให้เลือกมากมาย โรงภาพยนตร์รูปแบบ Standalone ณ สิ้นปี 2563 มี 5'
'สาขา ได้แก่สาขาปิ่นเกล้า สาขาสุขุมวิท สาขารัชโยธิน สาขารังสิต และสาขา เอสพลานาด งามวงศ์วาน-แคราย'
'นอกเหนือจากโรงภาพยนตร์รูปแบบ Standalone แล้ว บริษัทยังขยายสาขาในอีก 3 รูปแบบ ดังนี้ รูปแบบห้างสรรพสินค้า รูปแบบศูนย์การค้าแบบเปิดไลฟ์สไตล์มอลล์ รูปแบบห้างค้าปลีกขนาดใหญ่'
,
)));

}
}